charliermarsh.ruff
eamodio.gitlens
ecmel.vscode-html-css
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.vscode-speech
openai.chatgpt
qwtel.sqlite-viewer
xabikos.javascriptsnippets
